## æ€ç§‘å¸¸ç”¨å‘½ä»¤

`show`æŒ‡ä»¤ä¸èƒ½åœ¨å…¨å±€é…ç½®æ¨¡å¼ä¸‹ä½¿ç”¨

| å‘½ä»¤                                   | åŠŸèƒ½                                                     |
| -------------------------------------- | -------------------------------------------------------- |
| show interface                         | æŸ¥çœ‹æ‰€æœ‰ç«¯å£çš„ä¿¡æ¯                                       |
| show vlan                              | æŸ¥çœ‹æ‰€æœ‰VLANçš„ä¿¡æ¯                                       |
| show vlan brief                        | æŸ¥çœ‹æ‰€æœ‰VLANçš„ç®€è¦ä¿¡æ¯                                   |
| show interface interface-id switchport | æŸ¥çœ‹æŒ‡å®šç«¯å£çš„æ¥å…¥æ¨¡å¼                                   |
| show mac-address-table                 | æŸ¥çœ‹MACåœ°å€è¡¨çš„å†…å®¹                                      |
| show ip protocols                      | æŸ¥çœ‹è·¯ç”±åè®®ç›¸å…³ä¿¡æ¯                                     |
| show startup-config                    | æŸ¥çœ‹ç³»ç»Ÿé…ç½®                                             |
| show running-config                    | æŸ¥çœ‹å½“å‰çš„è¿è¡Œé…ç½®                                       |
| copy running-config startup-config     | æ›´æ–°ç³»ç»Ÿé…ç½®                                             |
| write                                  | ä¿å­˜é…ç½®                                                 |
| reload                                 | é‡å¯äº¤æ¢æœº                                               |
| enable                                 | è¿›å…¥ç‰¹æƒæ¨¡å¼                                             |
| disable                                | é€€å‡ºç‰¹æƒæ¨¡å¼                                             |
| exit                                   | é€€å‡ºåˆ°ä¸Šä¸€çº§é…ç½®æ¨¡å¼                                     |
| end                                    | é€€å‡ºåˆ°ç‰¹æƒæ¨¡å¼                                           |
| hostname newname                       | è®¾ç½®äº¤æ¢æœºåç§°(_éœ€è¦å…ˆè¿›å…¥å…¨å±€é…ç½®æ¨¡å¼_)                 |
| shutdown                               | ç¦ç”¨ç«¯å£                                                 |
| no shutdown                            | å¯ç”¨ç«¯å£                                                 |
| configure terminal                     | è¿›å…¥å…¨å±€é…ç½®æ¨¡å¼                                         |
| vlan vlan-id                           | è¿›å…¥VLANçš„é…ç½®ç•Œé¢                                       |
| name vlan-name                         | è®¾ç½®VLANåç§°(_éœ€è¦å…ˆè¿›å…¥VLANé…ç½®ç•Œé¢_)                   |
| no vlan vlan-id                        | åˆ é™¤æŒ‡å®šVLAN                                             |
| interface vlan vlan-id                 | è¿›å…¥æŒ‡å®šVLANçš„é…ç½®æ¨¡å¼(_VLANå…¶å®å°±ç›¸å½“äºä¸€ä¸ªè™šæ‹Ÿç«¯å£_)   |
| interface interface-id                 | è¿›å…¥æŒ‡å®šç«¯å£çš„é…ç½®æ¨¡å¼                                   |
| interface range interface-id           | è¿›å…¥æ‰¹é‡é…ç½®ç«¯å£çš„æ¨¡å¼                                   |
| duplex full                            | è®¾ç½®ç«¯å£ä¸ºå…¨åŒå·¥æ¨¡å¼(_éœ€è¦å…ˆè¿›å…¥æŒ‡å®šç«¯å£é…ç½®æ¨¡å¼_)       |
| speed xxx                              | è®¾ç½®ç«¯å£çš„é€Ÿåº¦(_éœ€è¦å…ˆè¿›å…¥æŒ‡å®šç«¯å£é…ç½®æ¨¡å¼_)             |
| ip address ip-address subnet-mask      | è®¾ç½®ç«¯å£çš„IPåœ°å€å’Œå­ç½‘æ©ç (_éœ€è¦å…ˆè¿›å…¥æŒ‡å®šç«¯å£é…ç½®æ¨¡å¼_) |
| switchport mode access                 | è®¾ç½®ç«¯å£ä¸ºVLANæ¥å…¥æ¨¡å¼(_éœ€è¦å…ˆè¿›å…¥æŒ‡å®šç«¯å£é…ç½®æ¨¡å¼_)     |
| switchport mode trunk                  | è®¾ç½®ç«¯å£ä¸ºä¸­ç»§æ¨¡å¼(_éœ€è¦å…ˆè¿›å…¥æŒ‡å®šç«¯å£é…ç½®æ¨¡å¼_)         |
| switchport access vlan vlan-id         | å°†æŒ‡å®šVLANåˆ†é…ç»™æŸä¸ªç«¯å£(_éœ€è¦å…ˆè¿›å…¥æŒ‡å®šç«¯å£é…ç½®æ¨¡å¼_)   |

## å¼€å¯telnet

```shell
Switch>
Switch>enable
Switch#configure terminal
Enter configuration commands, one per line.  End with CNTL/Z.
Switch(config)#interface vlan 1              // è¿›å…¥vlan 1çš„é…ç½®æ¨¡å¼
Switch(config-if)#ip address 192.168.0.254 255.255.255.0     // è®¾ç½®telnetåœ°å€,ç”¨æ¥è¿œç¨‹ç™»å½•
Switch(config-if)#no shutdown                // è®©é…ç½®ç«‹å³ç”Ÿæ•ˆ
Switch(config-if)#
%LINK-5-CHANGED: Interface Vlan1, changed state to up
%LINEPROTO-5-UPDOWN: Line protocol on Interface Vlan1, changed state to up
Switch(config-if)#exit
Switch(config)#
Switch(config)#line vty 0 4                  // è®¾ç½®è¿œç¨‹è™šæ‹Ÿç»ˆç«¯VTYçº¿è·¯æ•°é‡
Switch(config-line)#password 123456          // è®¾ç½®è¿œç¨‹ç™»å½•çš„å¯†ç 
Switch(config-line)#login                    // å¼€å¯ç™»å½•æ—¶éœ€è¦è¾“å…¥å¯†ç 
Switch(config-line)#exit
Switch(config)#
Switch(config)#exit
Switch#
%SYS-5-CONFIG_I: Configured from console by console
Switch#write                                 // ä¿å­˜é…ç½®
Building configuration...
[OK]
```

ç„¶åè®©éœ€è¦è¿›è¡Œè¿œç¨‹ç™»å½•çš„è®¾å¤‡çš„IPåœ°å€å’Œå­ç½‘æ©ç ä¸äº¤æ¢æœºçš„IPåœ°å€åœ¨åŒä¸€ç½‘æ®µï¼Œæ‰“å¼€ç»ˆç«¯

```shell
telnet 192.168.0.254 // è¾“å…¥ç™»å½•å¯†ç å³å¯è¿›å…¥äº¤æ¢æœº
```

## äºŒå±‚äº¤æ¢æœº

äºŒå±‚äº¤æ¢æœºå¸¸å¸¸ä½œä¸ºæ¥å…¥å±‚äº¤æ¢æœºä½¿ç”¨

![](./assets/äºŒå±‚äº¤æ¢æœºVLANé…ç½®.png)

:::warning ğŸ’¥æ­£å¸¸æ¥è¯´ï¼Œæ¥å…¥å±‚äº¤æ¢æœºçš„ä¸Šç½‘VLANæ˜¯ä¸åº”è¯¥é…ç½®IPåœ°å€çš„ï¼ŒIPè¦ä»ä¸Šå±‚è·¯ç”±è®¾å¤‡è·å–ã€‚è¦ç®¡ç†æ¥å…¥å±‚äº¤æ¢æœºåº”è¯¥ç”¨ä¸€ä¸ªå•ç‹¬çš„VLANï¼Œè¿™é‡Œåªæ˜¯ä¸ºäº†æ¼”ç¤ºè€Œå·²
:::

```shell
Switch>
Switch>enable
Switch#configure terminal
Enter configuration commands, one per line.  End with CNTL/Z.
Switch(config)#vlan 10                       // åˆ›å»ºvlan 10å¹¶è¿›å…¥é…ç½®ç•Œé¢
Switch(config-vlan)#name VLAN10              // è®¾ç½®vlanåç§°
Switch(config-vlan)#exit
Switch(config)#vlan 20                       // åˆ›å»ºvlan 20
Switch(config-vlan)#name VLAN20
Switch(config-vlan)#exit
Switch(config)#
Switch(config)#interface vlan 10             // è¿›å…¥vlan 10çš„é…ç½®æ¨¡å¼
Switch(config-if)#
%LINK-5-CHANGED: Interface Vlan10, changed state to up
Switch(config-if)#ip address 192.168.10.254 255.255.255.0     // ç»™vlan 10è®¾ç½®IPåœ°å€
// å¦‚æœæœ‰å¼€å¯telnetç™»å½•åŠŸèƒ½çš„è¯,ç»ˆç«¯è®¾å¤‡è¿˜èƒ½å¤Ÿé€šè¿‡è¿™ä¸ªIPåœ°å€è¿›è¡Œè¿œç¨‹ç™»å½•
Switch(config-if)#exit
Switch(config)#
Switch(config)#interface vlan 20             // è¿›å…¥vlan 20çš„é…ç½®æ¨¡å¼
Switch(config-if)#
%LINK-5-CHANGED: Interface Vlan20, changed state to up
Switch(config-if)#ip address 192.168.20.254 255.255.255.0     // ç»™vlan 20è®¾ç½®IPåœ°å€
Switch(config-if)#exit
Switch(config)#
Switch(config)#interface fastEthernet 0/1           // è¿›å…¥ç«¯å£1çš„é…ç½®æ¨¡å¼
Switch(config-if)#switchport access vlan 10         // æŠŠç«¯å£1åˆ’åˆ†ç»™vlan 10
Switch(config-if)#
%LINEPROTO-5-UPDOWN: Line protocol on Interface Vlan1, changed state to down
%LINEPROTO-5-UPDOWN: Line protocol on Interface Vlan10, changed state to up
Switch(config-if)#exit
Switch(config)#
Switch(config)#interface fastEthernet 0/2           // è¿›å…¥ç«¯å£2çš„é…ç½®æ¨¡å¼
Switch(config-if)#switchport access vlan 20         // æŠŠç«¯å£2åˆ’åˆ†ç»™vlan 20
Switch(config-if)#
%LINEPROTO-5-UPDOWN: Line protocol on Interface Vlan1, changed state to down
%LINEPROTO-5-UPDOWN: Line protocol on Interface Vlan20, changed state to up
Switch(config-if)#end
Switch#
%SYS-5-CONFIG_I: Configured from console by console
Switch#
Switch#write                                        // ä¿å­˜é…ç½®
Building configuration...
[OK]
```

## ä¸‰å±‚äº¤æ¢æœºå¸¸è§ç»„ç½‘

### æ–¹å¼ä¸€

:::tip âš¡å®ç°æ–¹å¼ä¸ºåˆ›å»ºä¸‰å±‚äº¤æ¢æœºçš„VLANé—´è·¯ç”±
:::

![](./assets/ä¸‰å±‚äº¤æ¢æœºVLANé…ç½®_1.png)

- **â‘ åˆ›å»ºVLAN**

```shell
Switch>
Switch>enable
Switch#vlan database                         // è¿›å…¥vlané…ç½®ç•Œé¢
% Warning: It is recommended to configure VLAN from config mode,
  as VLAN database mode is being deprecated. Please consult user
  documentation for configuring VTP/VLAN in config mode.
Switch(vlan)#vlan 10 name V10                // åˆ›å»ºvlan 10
VLAN 10 added:
    Name: V10
Switch(vlan)#vlan 20 name V20                // åˆ›å»ºvlan 20
VLAN 20 added:
    Name: V20
Switch(vlan)#exit
APPLY completed.
Exiting....
```

- **â‘¡å°†äº¤æ¢æœºçš„ç«¯å£åˆ’åˆ†ç»™VLAN**

```shell
Switch#
Switch#configure terminal
Enter configuration commands, one per line.  End with CNTL/Z.
Switch(config)#interface fastEthernet 0/1          // è¿›å…¥ç«¯å£1çš„é…ç½®æ¨¡å¼
Switch(config-if)#switchport access vlan 10        // æŠŠç«¯å£1åˆ’åˆ†ç»™vlan 10
Switch(config-if)#exit
Switch(config)#
Switch(config)#interface fastEthernet 0/2          // è¿›å…¥ç«¯å£2çš„é…ç½®æ¨¡å¼
Switch(config-if)#switchport access vlan 10        // æŠŠç«¯å£2åˆ’åˆ†ç»™vlan 10
Switch(config-if)#exit
Switch(config)#
Switch(config)#interface fastEthernet 0/3          // è¿›å…¥ç«¯å£3çš„é…ç½®æ¨¡å¼
Switch(config-if)#switchport access vlan 20        // æŠŠç«¯å£3åˆ’åˆ†ç»™vlan 20
Switch(config-if)#exit
Switch(config)#end
```

- **â‘¢é…ç½®VLANé—´çš„è·¯ç”±**

```shell
Switch#
Switch#configure terminal
Switch(config)#interface vlan 10                    // è¿›å…¥vlan 10çš„é…ç½®æ¨¡å¼
%LINK-5-CHANGED: Interface Vlan10, changed state to up
%LINEPROTO-5-UPDOWN: Line protocol on Interface Vlan10, changed state to up
Switch(config-if)#ip address 192.168.10.254 255.255.255.0     // ç»™vlan 10è®¾ç½®IPåœ°å€
Switch(config-if)#no shutdown
Switch(config-if)#exit
Switch(config)#interface vlan 20                    // è¿›å…¥vlan 20çš„é…ç½®æ¨¡å¼
%LINK-5-CHANGED: Interface Vlan20, changed state to up
%LINEPROTO-5-UPDOWN: Line protocol on Interface Vlan20, changed state to up
Switch(config-if)#ip address 192.168.20.254 255.255.255.0     // ç»™vlan 20è®¾ç½®IPåœ°å€
Switch(config-if)#no shutdown
Switch(config-if)#exit
Switch(config)#ip routing                    // å¼€å¯ä¸‰å±‚äº¤æ¢æœºçš„è·¯ç”±åŠŸèƒ½
Switch(config)#end
Switch#
Switch#write                                 // ä¿å­˜é…ç½®
Building configuration...
[OK]
Switch#show ip route                         // æŸ¥çœ‹è·¯ç”±è¡¨
Codes: C - connected, S - static, I - IGRP, R - RIP, M - mobile, B - BGP
       D - EIGRP, EX - EIGRP external, O - OSPF, IA - OSPF inter area
       N1 - OSPF NSSA external type 1, N2 - OSPF NSSA external type 2
       E1 - OSPF external type 1, E2 - OSPF external type 2, E - EGP
       i - IS-IS, L1 - IS-IS level-1, L2 - IS-IS level-2, ia - IS-IS inter area
       * - candidate default, U - per-user static route, o - ODR
       P - periodic downloaded static route

Gateway of last resort is not set

C    192.168.10.0/24 is directly connected, Vlan10
C    192.168.20.0/24 is directly connected, Vlan20
```

- **â‘£ä¸ºç»ˆç«¯è®¾å¤‡åˆ†é…IPåœ°å€å’Œé…ç½®ç½‘å…³**

---

### æ–¹å¼äºŒ

:::tip âš¡å®ç°æ–¹å¼ä¸ºåˆ›å»ºä¸‰å±‚äº¤æ¢æœºçš„VLANé—´è·¯ç”±
:::

![](./assets/ä¸‰å±‚äº¤æ¢æœºVLANé…ç½®_2.png)

- **â‘ å…ˆåœ¨äºŒå±‚äº¤æ¢æœºä¸­åˆ›å»ºVLANï¼Œå¹¶å°†ä¸Šè¡Œç«¯å£æ”¹ä¸ºtrunkæ¨¡å¼**

```shell
Switch>
Switch>enable
Switch#configure terminal
Enter configuration commands, one per line.  End with CNTL/Z.
Switch(config)#vlan 10                                // åˆ›å»ºvlan 10å¹¶è¿›å…¥é…ç½®ç•Œé¢
Switch(config-vlan)#name V10                          // è®¾ç½®vlanåç§°
Switch(config-vlan)#exit
Switch(config)#
Switch(config)#interface fastEthernet 0/1             // è¿›å…¥ç«¯å£1çš„é…ç½®æ¨¡å¼
Switch(config-if)#switchport access vlan 10           // æŠŠç«¯å£1åˆ’åˆ†ç»™vlan 10
Switch(config-if)#exit
Switch(config)#
Switch(config)#interface fastEthernet 0/2             // è¿›å…¥ç«¯å£2çš„é…ç½®æ¨¡å¼
Switch(config-if)#switchport access vlan 10           // æŠŠç«¯å£2åˆ’åˆ†ç»™vlan 10
Switch(config-if)#exit
Switch(config)#
Switch(config)#interface fastEthernet 0/24            // è¿›å…¥ç«¯å£24çš„é…ç½®æ¨¡å¼
Switch(config-if)#switchport mode trunk               // æŠŠç«¯å£24å¼ºåˆ¶æ”¹ä¸ºtrunkæ¨¡å¼
Switch(config-if)#
%LINEPROTO-5-UPDOWN: Line protocol on Interface FastEthernet0/24, changed state to down
%LINEPROTO-5-UPDOWN: Line protocol on Interface FastEthernet0/24, changed state to up
Switch(config-if)#end
Switch#
%SYS-5-CONFIG_I: Configured from console by console
Switch#write                                          // ä¿å­˜é…ç½®
Building configuration...
[OK]
```

- **â‘¡æ¥ç€åœ¨ä¸‰å±‚äº¤æ¢æœºä¸­åˆ›å»ºå’ŒäºŒå±‚ä¸€æ ·çš„VLAN**

```shell
Switch>
Switch>enable
Switch#vlan database                                  // è¿›å…¥vlané…ç½®ç•Œé¢
% Warning: It is recommended to configure VLAN from config mode,
  as VLAN database mode is being deprecated. Please consult user
  documentation for configuring VTP/VLAN in config mode.
Switch(vlan)#vlan 10 name V10                         // åˆ›å»ºvlan 10
VLAN 10 added:
    Name: V10
Switch(vlan)#vlan 20 name V20                         // åˆ›å»ºvlan 20
VLAN 20 added:
    Name: V20
Switch(vlan)#exit
APPLY completed.
Exiting....
Switch#
```

- **â‘¢ç»™ä¸‰å±‚äº¤æ¢æœºçš„VLANè®¾ç½®IPåœ°å€**

```shell
Switch#
Switch#configure terminal
Enter configuration commands, one per line.  End with CNTL/Z.
Switch(config)#interface vlan 10                       // è¿›å…¥vlan 10çš„é…ç½®æ¨¡å¼
Switch(config-if)#
%LINK-5-CHANGED: Interface Vlan10, changed state to up
%LINEPROTO-5-UPDOWN: Line protocol on Interface Vlan10, changed state to up
Switch(config-if)#ip address 192.168.10.254 255.255.255.0         // ç»™vlan 10è®¾ç½®IPåœ°å€
Switch(config-if)#exit
Switch(config)#
Switch(config)#interface vlan 20                       // è¿›å…¥vlan 20çš„é…ç½®æ¨¡å¼
Switch(config-if)#
%LINK-5-CHANGED: Interface Vlan20, changed state to up
%LINEPROTO-5-UPDOWN: Line protocol on Interface Vlan20, changed state to up
Switch(config-if)#ip address 192.168.20.254 255.255.255.0         // ç»™vlan 20è®¾ç½®IPåœ°å€
Switch(config-if)#exit
```

- **â‘£å¼€å¯ä¸‰å±‚äº¤æ¢æœºçš„è·¯ç”±åŠŸèƒ½**

```shell
Switch(config)#
Switch(config)#ip routing                              // å¼€å¯ä¸‰å±‚äº¤æ¢æœºçš„è·¯ç”±åŠŸèƒ½
Switch(config)#exit
Switch#
%SYS-5-CONFIG_I: Configured from console by console
Switch#write                                           // ä¿å­˜é…ç½®
Building configuration...
[OK]
Switch#
Switch#show ip route                                   // æŸ¥çœ‹è·¯ç”±è¡¨
Codes: C - connected, S - static, I - IGRP, R - RIP, M - mobile, B - BGP
       D - EIGRP, EX - EIGRP external, O - OSPF, IA - OSPF inter area
       N1 - OSPF NSSA external type 1, N2 - OSPF NSSA external type 2
       E1 - OSPF external type 1, E2 - OSPF external type 2, E - EGP
       i - IS-IS, L1 - IS-IS level-1, L2 - IS-IS level-2, ia - IS-IS inter area
       * - candidate default, U - per-user static route, o - ODR
       P - periodic downloaded static route

Gateway of last resort is not set

C    192.168.10.0/24 is directly connected, Vlan10
C    192.168.20.0/24 is directly connected, Vlan20
```

- **â‘¤ä¸ºç»ˆç«¯è®¾å¤‡åˆ†é…IPåœ°å€å’Œé…ç½®ç½‘å…³**

---

### æ–¹å¼ä¸‰

:::tip âš¡å®ç°æ–¹å¼ä¸ºå°†ä¸‰å±‚äº¤æ¢æœºçš„äº¤æ¢ç«¯å£æ”¹ä¸ºè·¯ç”±ç«¯å£ï¼ŒäºŒå±‚äº¤æ¢æœºä½œä¸ºæ¥å…¥å±‚äº¤æ¢æœºä¿æŒé»˜è®¤å°±è¡Œ
:::

![](./assets/ä¸‰å±‚äº¤æ¢æœºVLANé…ç½®_3.png)

- **â‘ é…ç½®ä¸‰å±‚äº¤æ¢æœºè·¯ç”±ç«¯å£**

```shell
Switch>
Switch>enable
Switch#configure terminal
Enter configuration commands, one per line.  End with CNTL/Z.
Switch(config)#
Switch(config)#interface fastEthernet 0/1           // è¿›å…¥ç«¯å£1çš„é…ç½®æ¨¡å¼
Switch(config-if)#no switchport                     // æŠŠç«¯å£1æ”¹ä¸ºè·¯ç”±ç«¯å£
Switch(config-if)#
%LINEPROTO-5-UPDOWN: Line protocol on Interface FastEthernet0/1, changed state to down
%LINEPROTO-5-UPDOWN: Line protocol on Interface FastEthernet0/1, changed state to up
Switch(config-if)#ip address 192.168.10.254 255.255.255.0      // ç»™ç«¯å£1è®¾ç½®IPåœ°å€
Switch(config-if)#no shutdown
Switch(config-if)#exit
Switch(config)#
Switch(config)#interface fastEthernet 0/2           // è¿›å…¥ç«¯å£2çš„é…ç½®æ¨¡å¼
Switch(config-if)#no switchport                     // æŠŠç«¯å£2æ”¹ä¸ºè·¯ç”±ç«¯å£
Switch(config-if)#
%LINEPROTO-5-UPDOWN: Line protocol on Interface FastEthernet0/2, changed state to down
%LINEPROTO-5-UPDOWN: Line protocol on Interface FastEthernet0/2, changed state to up
Switch(config-if)#ip address 192.168.20.254 255.255.255.0      // ç»™ç«¯å£2è®¾ç½®IPåœ°å€
Switch(config-if)#no shutdown
Switch(config-if)#exit
Switch(config)#
Switch(config)#ip routing                           // å¼€å¯ä¸‰å±‚äº¤æ¢æœºçš„è·¯ç”±åŠŸèƒ½
Switch(config)#end
Switch#
Switch#write                                        // ä¿å­˜é…ç½®
Building configuration...
[OK]
```

- **â‘¡ä¸ºç»ˆç«¯è®¾å¤‡åˆ†é…IPåœ°å€å’Œé…ç½®ç½‘å…³**
